In [1]:
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np
import seaborn
seaborn.set_style("whitegrid")
import warnings
warnings.filterwarnings("ignore")

In [2]:
df1 = pd.read_csv("train.csv")

In [3]:
df1.shape

(891, 12)

In [4]:
df2 = pd.read_csv("test.csv")

In [5]:
df2.shape

(418, 11)

In [6]:
df = df1.append(df2)

<h2> EDA </h2>

In [7]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df1.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
df2.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [10]:
df.shape

(1309, 12)

In [11]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [12]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0.0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0.0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0.0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1.0,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1.0,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [13]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,1309.000000,891.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000
mean,655.000000,0.383838,2.294882,29.881138,0.498854,0.385027,33.295479
std,378.020061,0.486592,0.837836,14.413493,1.041658,0.865560,51.758668
min,1.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,328.000000,0.000000,2.000000,21.000000,0.000000,0.000000,7.895800
50%,655.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,982.000000,1.000000,3.000000,39.000000,1.000000,0.000000,31.275000
max,1309.000000,1.000000,3.000000,80.000000,8.000000,9.000000,512.329200

In [14]:
df.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.038354,0.028814,-0.055224,0.008942,0.031428
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.038354,-0.338481,1.000000,-0.408106,0.060832,0.018322,-0.558629
Age,0.028814,-0.077221,-0.408106,1.000000,-0.243699,-0.150917,0.178740
SibSp,-0.055224,-0.035322,0.060832,-0.243699,1.000000,0.373587,0.160238
Parch,0.008942,0.081629,0.018322,-0.150917,0.373587,1.000000,0.221539
Fare,0.031428,0.257307,-0.558629,0.178740,0.160238,0.221539,1.000000

<h2> Classification </h2>

<h3> Setup </h3>

In [15]:
del df['Survived']

In [16]:
df['Embarked'].value_counts()

S    914
C    270
Q    123
Name: Embarked, dtype: int64

In [17]:
df['Title'] = df['Name'].str.extract('([A-Za-z]+)\.', expand=False)
df['Title'].value_counts()

Mr          757
Miss        260
Mrs         197
Master       61
Dr            8
Rev           8
Col           4
Ms            2
Major         2
Mlle          2
Lady          1
Countess      1
Sir           1
Don           1
Capt          1
Dona          1
Jonkheer      1
Mme           1
Name: Title, dtype: int64

In [18]:
df['Title'] = df['Title'].replace(['Ms', 'Mlle'], 'Miss')
df['Title'] = df['Title'].replace(['Mme', 'Countess', 'Lady', 'Dona'], 'Mrs')
df['Title'] = df['Title'].replace(['Dr', 'Major', 'Col', 'Sir', 'Rev', 'Jonkheer', 'Capt', 'Don'], 'Mr')

In [19]:
df["FamilySize"] = df["SibSp"] + df["Parch"] + 1
df.FamilySize.value_counts()

1     790
2     235
3     159
4      43
6      25
5      22
7      16
11     11
8       8
Name: FamilySize, dtype: int64

In [20]:
df["Age"].fillna(df.groupby("Title")["Age"].transform("median"), inplace= True)

In [21]:
df.groupby("Title")["Age"].transform("median")

0      30.0
1      35.5
2      22.0
3      35.5
4      30.0
       ...
413    30.0
414    35.5
415    30.0
416    30.0
417     4.0
Name: Age, Length: 1309, dtype: float64

In [22]:
df["Fare"].fillna(df["Fare"].mean(), inplace= True)

In [23]:
df.isnull().sum()

PassengerId       0
Pclass            0
Name              0
Sex               0
Age               0
SibSp             0
Parch             0
Ticket            0
Fare              0
Cabin          1014
Embarked          2
Title             0
FamilySize        0
dtype: int64

In [24]:
df['Embarked'].fillna('S', inplace = True)

In [25]:
del df['Cabin']

In [26]:
#del df['Age']

In [27]:
del df['Name']

In [28]:
df.drop(['PassengerId', 'Ticket'], axis = 1, inplace = True)

In [30]:
df['Sex'].replace({'male':1, 'female':0}, inplace = True)
df['Sex'] = df['Sex'].astype('category')

In [31]:
df['Embarked'].replace({'S':1, 'Q':0, 'C':2}, inplace = True)
df['Embarked'] = df['Embarked'].astype('category')

In [32]:
df.Title.value_counts()

Mr        783
Miss      264
Mrs       201
Master     61
Name: Title, dtype: int64

In [33]:
df['Title'].replace({'Mr':1, 'Miss':0, 'Mrs':2, 'Master':3}, inplace = True)
df['Title'] = df['Title'].astype('category')

In [34]:
df.sample(5)

     Pclass Sex   Age  SibSp  Parch     Fare Embarked Title  FamilySize
269       3   1  17.0      0      0   8.6625        1     1           1
7         2   1  26.0      1      1  29.0000        1     1           3
246       3   0  25.0      0      0   7.7750        1     0           1
719       3   1  33.0      0      0   7.7750        1     1           1
25        3   1  50.0      1      0  14.5000        1     1           2

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      1309 non-null   int64
 1   Sex         1309 non-null   category
 2   Age         1309 non-null   float64
 3   SibSp       1309 non-null   int64
 4   Parch       1309 non-null   int64
 5   Fare        1309 non-null   float64
 6   Embarked    1309 non-null   category
 7   Title       1309 non-null   category
 8   FamilySize  1309 non-null   int64
dtypes: category(3), float64(2), int64(4)
memory usage: 75.9 KB

In [36]:
df.isnull().sum()

Pclass        0
Sex           0
Age           0
SibSp         0
Parch         0
Fare          0
Embarked      0
Title         0
FamilySize    0
dtype: int64

In [37]:
df_dummies = pd.get_dummies(df, drop_first =True)
df_dummies.sample(5)

,Pclass,Age,SibSp,Parch,Fare,FamilySize,Sex_1,Embarked_1,Embarked_2,Title_1,Title_2,Title_3
747,2,30.0,0,0,13.0000,1,0,1,0,0,0,0
167,3,18.0,2,2,34.3750,5,1,1,0,1,0,0
775,3,18.0,0,0,7.7500,1,1,1,0,1,0,0
632,1,32.0,0,0,30.5000,1,1,0,1,1,0,0
679,1,36.0,0,1,512.3292,2,1,0,1,1,0,0

In [38]:
df_dummies.isnull().sum()

Pclass        0
Age           0
SibSp         0
Parch         0
Fare          0
FamilySize    0
Sex_1         0
Embarked_1    0
Embarked_2    0
Title_1       0
Title_2       0
Title_3       0
dtype: int64

In [39]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
df_dummies = sc.fit_transform(df_dummies) #normailize

In [40]:
df1.shape, df2.shape

((891, 12), (418, 11))

In [41]:
n_train = df1.shape[0]
n_test = df2.shape[0]

In [42]:
df_train = df_dummies[:n_train]
df_test = df_dummies[n_train:]

In [43]:
y = df1['Survived']

In [44]:
from sklearn.metrics import accuracy_score, precision_score, recall_score, f1_score
from sklearn.metrics import confusion_matrix, classification_report

In [45]:
from sklearn.naive_bayes import GaussianNB
from sklearn.naive_bayes import BernoulliNB
from sklearn.neighbors import KNeighborsClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import GradientBoostingClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.tree import DecisionTreeClassifier

g = GaussianNB()
b = BernoulliNB()
k = KNeighborsClassifier()
log = LogisticRegression()
gbc = GradientBoostingClassifier()
r = RandomForestClassifier()
d = DecisionTreeClassifier()

algorithms = [g, b, k, log, gbc, r, d]
names = ['GaussianNB', 'BernoulliNB', 'K Nearest', 'Logistic', 'GradientBoosting', 'RandomForest', 'Decision Tree']

In [46]:
def evaluate_model(x, y, algorithms = algorithms, names = names):
    # fit the data
    for i in range(len(algorithms)):
        algorithms[i] = algorithms[i].fit(x, y)
    # print metrics
    accuracy = []
    precision = []
    recall = []
    f1 = []
    for i in range(len(algorithms)):
        if accuracy_score(y, algorithms[i].predict(x)) == 1:
            accuracy.append(0)
        else:   
            accuracy.append(accuracy_score(y, algorithms[i].predict(x)))
        if precision_score(y, algorithms[i].predict(x)) == 1:
            precision.append(0)
        else:   
            precision.append(accuracy_score(y, algorithms[i].predict(x)))
        if recall_score(y, algorithms[i].predict(x)) == 1:
            recall.append(0)
        else:   
            recall.append(accuracy_score(y, algorithms[i].predict(x)))
        if f1_score(y, algorithms[i].predict(x)) == 1:
            f1.append(0)
        else:   
            f1.append(accuracy_score(y, algorithms[i].predict(x)))
    metrics = pd.DataFrame(columns = ['Accuracy', 'Precision', 'Recall', 'F1'], index = names)
    metrics['Accuracy'] = accuracy
    metrics['Precision'] = precision
    metrics['Recall'] = recall
    metrics['F1'] = f1
    return metrics.sort_values('Accuracy', ascending = False)

In [47]:
evaluate_model(df_train, y)

                  Accuracy  Precision    Recall        F1
RandomForest      0.979798   0.979798  0.979798  0.979798
Decision Tree     0.979798   0.979798  0.979798  0.979798
GradientBoosting  0.901235   0.901235  0.901235  0.901235
K Nearest         0.870932   0.870932  0.870932  0.870932
Logistic          0.830527   0.830527  0.830527  0.830527
GaussianNB        0.817059   0.817059  0.817059  0.817059
BernoulliNB       0.793490   0.793490  0.793490  0.793490

In [48]:
r = RandomForestClassifier()
model = r.fit(df_train,y)

In [49]:
prediction = r.predict(df_test)

In [50]:
result = pd.DataFrame()
result['PassengerId'] = df2['PassengerId']
result['Survived'] = prediction

result.to_csv('prediction.csv', index = False)

In [51]:
ctrl = pd.read_csv('prediction.csv')
ctrl.sample(10)

     PassengerId  Survived
387         1279         0
309         1201         0
97           989         0
237         1129         1
29           921         0
188         1080         0
241         1133         1
200         1092         1
274         1166         0
315         1207         1